OpenFOAM/WFD_OpenFOAM/cases/batch_20260528_104510_fa7b09/pitch_7p5_baseline_chord/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-7;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    rho
    {
        solver          diagonal;
    }

    rhoFinal
    {
        $rho;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    h
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }

    hFinal
    {
        $h;
        relTol          0;
    }

    e
    {
        $h;
    }

    eFinal
    {
        $e;
        relTol          0;
    }

    k
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }

    kFinal
    {
        $k;
        relTol          0;
    }

    omega
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }

    omegaFinal
    {
        $omega;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor       yes;
    nOuterCorrectors        2;
    nCorrectors             2;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
        p     0.3;
        rho   0.5;
    }

    equations
    {
        U                   0.5;
        "(h|e)"             0.5;
        "(k|omega)"         0.5;
    }
}

// ************************************************************************* //
